package javarush.java_syntax_1.level4.lecture10.task4;

public class DivinationOnDollarAccount {
/*
    Вывести на экран квадрат из 10х10 букв S используя цикл while.
    Буквы в каждой строке не разделять.

    Пример вывода на экран:
    SSSSSSSSSS
    SSSSSSSSSS
    SSSSSSSSSS
    SSSSSSSSSS
    SSSSSSSSSS
    SSSSSSSSSS
    SSSSSSSSSS
    SSSSSSSSSS
    SSSSSSSSSS
    SSSSSSSSSS
*/
/*
  package com.javarush.Task.task04.task0433;
*/
/*
Гадание на долларовый счет
*/
    public static void main(String[] args) throws Exception {
        int a = 10;
        while (a >= 1) {
            System.out.println("SSSSSSSSSS");//напишите тут ваш код
            a--;
        }
    }
}
