package javarush.java_syntax_1.level5.lecture12.task4;
/*
package com.javarush.Task.task05.task0528;
*/
/*
Вывести на экран сегодняшнюю дату
*/
/*
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
*/

public class Solution {
    public static void main(String[] args) {
        int day = 13;
        int year = 2018;
        System.out.println(day + " 09 " + year);//напишите тут ваш код
    }
}

